benchmark/results/pessimistic_vu200.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/pessimistic.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 55s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 25s over 2 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 040/200 VUs, 179 complete and 0 interrupted iterations
default   [   4% ] 040/200 VUs  01.0s/25.0s

running (02.0s), 079/200 VUs, 386 complete and 0 interrupted iterations
default   [   8% ] 079/200 VUs  02.0s/25.0s

running (03.0s), 119/200 VUs, 555 complete and 0 interrupted iterations
default   [  12% ] 119/200 VUs  03.0s/25.0s

running (04.0s), 159/200 VUs, 711 complete and 0 interrupted iterations
default   [  16% ] 159/200 VUs  04.0s/25.0s

running (05.0s), 199/200 VUs, 837 complete and 0 interrupted iterations
default   [  20% ] 199/200 VUs  05.0s/25.0s

running (06.0s), 200/200 VUs, 998 complete and 0 interrupted iterations
default   [  24% ] 200/200 VUs  06.0s/25.0s

running (07.0s), 200/200 VUs, 1161 complete and 0 interrupted iterations
default   [  28% ] 200/200 VUs  07.0s/25.0s

running (08.0s), 200/200 VUs, 1337 complete and 0 interrupted iterations
default   [  32% ] 200/200 VUs  08.0s/25.0s

running (09.0s), 200/200 VUs, 1557 complete and 0 interrupted iterations
default   [  36% ] 200/200 VUs  09.0s/25.0s

running (10.0s), 200/200 VUs, 1765 complete and 0 interrupted iterations
default   [  40% ] 200/200 VUs  10.0s/25.0s

running (11.0s), 200/200 VUs, 1955 complete and 0 interrupted iterations
default   [  44% ] 200/200 VUs  11.0s/25.0s

running (12.0s), 200/200 VUs, 2166 complete and 0 interrupted iterations
default   [  48% ] 200/200 VUs  12.0s/25.0s

running (13.0s), 200/200 VUs, 2386 complete and 0 interrupted iterations
default   [  52% ] 200/200 VUs  13.0s/25.0s

running (14.0s), 200/200 VUs, 2603 complete and 0 interrupted iterations
default   [  56% ] 200/200 VUs  14.0s/25.0s

running (15.0s), 200/200 VUs, 2816 complete and 0 interrupted iterations
default   [  60% ] 200/200 VUs  15.0s/25.0s

running (16.0s), 200/200 VUs, 2995 complete and 0 interrupted iterations
default   [  64% ] 200/200 VUs  16.0s/25.0s

running (17.0s), 200/200 VUs, 3176 complete and 0 interrupted iterations
default   [  68% ] 200/200 VUs  17.0s/25.0s

running (18.0s), 200/200 VUs, 3396 complete and 0 interrupted iterations
default   [  72% ] 200/200 VUs  18.0s/25.0s

running (19.0s), 200/200 VUs, 3617 complete and 0 interrupted iterations
default   [  76% ] 200/200 VUs  19.0s/25.0s

running (20.0s), 200/200 VUs, 3821 complete and 0 interrupted iterations
default   [  80% ] 200/200 VUs  20.0s/25.0s

running (21.0s), 200/200 VUs, 4042 complete and 0 interrupted iterations
default   [  84% ] 200/200 VUs  21.0s/25.0s

running (22.0s), 200/200 VUs, 4249 complete and 0 interrupted iterations
default   [  88% ] 200/200 VUs  22.0s/25.0s

running (23.0s), 200/200 VUs, 4426 complete and 0 interrupted iterations
default   [  92% ] 200/200 VUs  23.0s/25.0s

running (24.0s), 200/200 VUs, 4652 complete and 0 interrupted iterations
default   [  96% ] 200/200 VUs  24.0s/25.0s

running (25.0s), 200/200 VUs, 4837 complete and 0 interrupted iterations
default   [ 100% ] 200/200 VUs  25.0s/25.0s


  █ TOTAL RESULTS 

    checks_total.......: 5042    194.319871/s
    checks_succeeded...: 100.00% 5042 out of 5042
    checks_failed......: 0.00%   0 out of 5042

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=909.58ms min=13.11ms med=943.69ms p(90)=1.17s p(95)=1.2s p(99)=1.22s max=1.24s
      { expected_response:true }...: avg=909.58ms min=13.11ms med=943.69ms p(90)=1.17s p(95)=1.2s p(99)=1.22s max=1.24s
    http_req_failed................: 0.00%  0 out of 5042
    http_reqs......................: 5042   194.319871/s

    EXECUTION
    iteration_duration.............: avg=910.52ms min=13.47ms med=945.45ms p(90)=1.17s p(95)=1.2s p(99)=1.22s max=1.24s
    iterations.....................: 5042   194.319871/s
    vus............................: 200    min=40        max=200
    vus_max........................: 200    min=200       max=200

    NETWORK
    data_received..................: 963 kB 37 kB/s
    data_sent......................: 1.2 MB 45 kB/s



running (25.9s), 000/200 VUs, 5042 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/200 VUs  25s